app/Controllers/ResidentsController.php

    public function index()
    {
        $fetchResidents = new ResidentsModel();
        $data['residents'] = $fetchResidents->findAll();
---
SELECT *
FROM `tbl_residents`

    public function storeResident()
    {
        // store a residents
        $insertResidents = new ResidentsModel();

        if ($img = $this->request->getFile('residentProfile')) {
            if($img->isValid() && ! $img->hasMoved()) {
                $imageName = $img->getRandomName();
                $img->move('uploads/', $imageName);
            }
        }

        $data = array (
            'block_#' => $this->request->getPost('residentBlock'),
            'lot_#' => $this->request->getPost('residentLot'),
            'residents_name' => $this->request->getPost('residentName'),
            'residents_age' => $this->request->getPost('residentAge'),
            'residents_address' => $this->request->getPost('residentAddress'),
            'residents_gender' => $this->request->getPost('residentGender'),
            'residents_email' => $this->request->getPost('residentEmail'),
            'residents_password' => $this->request->getPost('residentPassword'),
            'residents_profile' => $imageName,
        );

        $insertResidents->insert($data);
---
INSERT INTO `tbl_residents` (`block_#`, `lot_#`, `residents_name`, `residents_age`, `residents_address`, `residents_gender`, `residents_email`, `residents_password`, `residents_profile`) VALUES ('Timpas', 'Panitan', 'Cady Durn ', '18', 'NHA, Timpas, Panitan, Capiz', 'Female', 'ketket@gmail.com', NULL, '1707582958_309302c2dff04ccad8c8.jpg')

    public function editResident($residentId)
{
    $residentsModel = new ResidentsModel();
    $resident = $residentsModel->find($residentId);
---
SELECT *
FROM `tbl_residents`
WHERE `tbl_residents`.`id` = '17'

    public function deleteResident($id)
    {
        $deleteResidents = new ResidentsModel();
        $deleteResidents->delete($id);
---
DELETE FROM `tbl_residents`
WHERE `id` IN ('16')